Agat/src/Catalogs/ЗадачиПланировщик/ЗадачиПланировщик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗадачиПланировщик</name>
  <attributes>
    <name>Контроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Н</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаОснование</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующегоСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСЗаказчиком</name>
    <type>
      <types>CatalogRef.Договора</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСПодрядчиком</name>
    <type>
      <types>CatalogRef.ДоговораСубподряда</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящиеДокументы</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящиеДокументы</name>
    <type>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспоряженияГД</name>
    <type>
      <types>CatalogRef.РаспоряженияГД</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспоряженияТД</name>
    <type>
      <types>CatalogRef.РаспоряженияТД</types>
    </type>
  </attributes>
  <attributes>
    <name>Тематика</name>
    <type>
      <types>CatalogRef.Тематика</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйИсполнительЗадачи</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнителиЗадачи</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачиПланировщик</name>
    <type>
      <types>CatalogRef.ЗадачиПланировщик</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Приложения</name>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РасширениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыИсполнения</name>
    <attributes>
      <name>НаименованиеЭтапа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокИсполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИсполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РасширениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Н</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактныеДанные</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭлектроннаяПочта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Agat/src/Catalogs/ЗадачиПланировщик/Forms/ФормаСписка/Module.bsl
// =============================================================================
// СИСТЕМНЫЕ СОБЫТИЯ ФОРМЫ
// =============================================================================

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ ЗначениеЗаполнено(СрокИсполненияДатаС) Тогда
		СрокИсполненияДатаС = НачалоМесяца(ТекущаяДата());
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(СрокИсполненияДатаПо) Тогда
		СрокИсполненияДатаПо = КонецМесяца(ТекущаяДата());
	КонецЕсли;

	ОбновитьПланировщикИДиаграммуГантаНаСервере();

КонецПроцедуры

// =============================================================================
// ФИЛЬТР ПЕРИОДА (ДатаС / ДатаПо) - влияет на Планировщик и ДиагаммаГанта
// =============================================================================

&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
	ОбновитьПланировщикИДиаграммуГантаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПоПриИзменении(Элемент)
	ОбновитьПланировщикИДиаграммуГантаНаСервере();
КонецПроцедуры

// =============================================================================
// ЗАПОЛНЕНИЕ ПЛАНИРОВЩИКА И ДИАГРАММЫ ГАНТА ПО ДАННЫМ ТЧ "ЭтапыИсполнения"
// =============================================================================
// Объектная модель всех полей подтверждена по Синтаксис-Помощнику:
// Планировщик.Элементы (КоллекцияЭлементовПланировщика: Добавить/Очистить/...),
// ЭлементПланировщика.Начало / .Конец / .Текст,
// Планировщик.НачалоПериодаОтображения / .КонецПериодаОтображения.
// Планировщик.Измерения[0] (ИзмерениеПланировщика) - настроено в Конфигураторе
// с типом значения СправочникСсылка.ЗадачиПланировщик (даёт группировку строк
// по задаче - реквизит Наименование - слева, в виде разделов).
// ИзмерениеПланировщика.Элементы.Добавить(<Значение>, <Текст>) -> ЭлементИзмеренияПланировщика
// (Значение должно быть уникальным в пределах коллекции - на задачу заводим
// раздел один раз, дальше переиспользуем через РазделыПоЗадачам).
// ЭлементИзмеренияПланировщика.Элементы - та же коллекция ЭлементПланировщика,
// что и Планировщик.Элементы, но добавленные через неё элементы попадают в
// соответствующий раздел (секцию) слева.
// ДиаграммаГанта.УстановитьТочку/УстановитьСерию/ПолучитьЗначение/Очистить,
// ЗначениеДиаграммыГанта.Добавить() -> ИнтервалДиаграммыГанта.Начало/Конец/Текст.
&НаСервере
Процедура ОбновитьПланировщикИДиаграммуГантаНаСервере()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаС", НачалоДня(СрокИсполненияДатаС));
	Запрос.УстановитьПараметр("ДатаПо", КонецДня(СрокИсполненияДатаПо));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭтапыИсполнения.Ссылка КАК Задача,
	|	ЭтапыИсполнения.Ссылка.Наименование КАК НаименованиеЗадачи,
	|	ЭтапыИсполнения.НаименованиеЭтапа КАК НаименованиеЭтапа,
	|	ЭтапыИсполнения.ДатаНачала КАК ДатаНачала,
	|	ЭтапыИсполнения.СрокИсполнения КАК СрокИсполнения
	|ИЗ
	|	Справочник.ЗадачиПланировщик.ЭтапыИсполнения КАК ЭтапыИсполнения
	|ГДЕ
	|	НЕ ЭтапыИсполнения.Ссылка.ПометкаУдаления
	|	И ЭтапыИсполнения.СрокИсполнения МЕЖДУ &ДатаС И &ДатаПо
	|
	|УПОРЯДОЧИТЬ ПО
	|	СрокИсполнения";

	ВыборкаЭтапов = Запрос.Выполнить().Выбрать();

	// --- Планировщик: раздел слева = задача (Наименование), в разделе - интервалы этапов ---
	Планировщик.Элементы.Очистить();
	Измерение = Планировщик.Измерения[0];
	Измерение.Элементы.Очистить();
	Планировщик.НачалоПериодаОтображения = НачалоДня(СрокИсполненияДатаС);
	Планировщик.КонецПериодаОтображения = КонецДня(СрокИсполненияДатаПо);

	РазделыПоЗадачам = Новый Соответствие;

	Пока ВыборкаЭтапов.Следующий() Цикл

		Если НЕ ЗначениеЗаполнено(ВыборкаЭтапов.ДатаНачала)
			ИЛИ НЕ ЗначениеЗаполнено(ВыборкаЭтапов.СрокИсполнения) Тогда
			Продолжить;
		КонецЕсли;

		Раздел = РазделыПоЗадачам[ВыборкаЭтапов.Задача];
		Если Раздел = Неопределено Тогда
			Раздел = Измерение.Элементы.Добавить(ВыборкаЭтапов.Задача, ВыборкаЭтапов.НаименованиеЗадачи);
			РазделыПоЗадачам.Вставить(ВыборкаЭтапов.Задача, Раздел);
		КонецЕсли;

//		ЭлементПланировщика = Раздел.Элементы.Добавить(ВыборкаЭтапов.ДатаНачала, ВыборкаЭтапов.СрокИсполнения);
//		ЭлементПланировщика.Текст = ВыборкаЭтапов.НаименованиеЭтапа;
		
		
		
		
	КонецЦикла;

	// --- ДиагаммаГанта: все значения СрокИсполнения на единой линии времени ---
	ВыборкаЭтапов.Сбросить();

	ДиагаммаГантаОднаЛиния.Очистить();
	ТочкаЛинии = ДиагаммаГантаОднаЛиния.УстановитьТочку("ЭтапыИсполнения", "НаименованиеЗадачи");
//	ТочкаЛинии.Текст = "Задачи";
	СерияЛинии = ДиагаммаГантаОднаЛиния.УстановитьСерию("СрокиИсполнения");
	ЗначениеЛинии = ДиагаммаГантаОднаЛиния.ПолучитьЗначение(ТочкаЛинии, СерияЛинии);

	Пока ВыборкаЭтапов.Следующий() Цикл

		Если НЕ ЗначениеЗаполнено(ВыборкаЭтапов.СрокИсполнения) Тогда
			Продолжить;
		КонецЕсли;

		Интервал = ЗначениеЛинии.Добавить();
		Интервал.Начало = ВыборкаЭтапов.ДатаНачала;
		Интервал.Конец  = ВыборкаЭтапов.СрокИсполнения;
		Интервал.Текст  = ВыборкаЭтапов.НаименованиеЗадачи + " / " + ВыборкаЭтапов.НаименованиеЭтапа;
		
	КонецЦикла;    
    
КонецПроцедуры
